/*
┌──────────────────────────────────────────────────────────────┐
│　描   述：枚举导航类型.
│　作   者：Obase开发团队
│　版权所有：武汉乐程软工科技有限公司
│　创建时间：2025-6-25 10:54:23
└──────────────────────────────────────────────────────────────┘
*/

namespace Obase.Core.Odm
{
    /// <summary>
    ///     枚举导航类型。
    /// </summary>
    public enum ENavigationType
    {
        /// <summary>
        ///     直接导航。
        /// </summary>
        Directly,

        /// <summary>
        ///     间接导航。
        /// </summary>
        Indirectly
    }
}