/*
┌──────────────────────────────────────────────────────────────┐
│　描   述：对象取值器接口,从对象中获取类型元素的值.
│　作   者：Obase开发团队
│　版权所有：武汉乐程软工科技有限公司
│　创建时间：2025-6-24 16:27:23
└──────────────────────────────────────────────────────────────┘
*/

namespace Obase.Core.Odm
{
    /// <summary>
    ///     对象取值器接口。
    ///     对象取值器用于从对象中获取其属性、关联引用或关联端的值。
    /// </summary>
    public interface IValueGetter
    {
        /// <summary>
        ///     从指定对象取值。
        /// </summary>
        /// <param name="obj">目标对象</param>
        object GetValue(object obj);
    }
}
