/*
┌──────────────────────────────────────────────────────────────┐
│　描   述：枚举逻辑运算符.
│　作   者：Obase开发团队
│　版权所有：武汉乐程软工科技有限公司
│　创建时间：2025-6-26 09:53:35
└──────────────────────────────────────────────────────────────┘
*/

namespace Obase.Core
{
    /// <summary>
    ///     枚举逻辑运算符
    /// </summary>
    public enum ELogicalOperator
    {
        /// <summary>
        ///     与
        /// </summary>
        And,

        /// <summary>
        ///     或
        /// </summary>
        Or,

        /// <summary>
        ///     非
        /// </summary>
        Not
    }
}